using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace Laba1_Kantemir
{
    class Notebook
    {
        public static List<Book> book = new List<Book>();
        static void Main(string[] args)
        {
            while (true)
            {
                Console.WriteLine("***********************************************************************************************************************");
                Console.WriteLine("Приветствую тебя, дорогой гость, в самой современной записной книжке. В данной книжке можно:\n1) создавать новые записи;\n2) редактировать записи;\n3) просматривать записи(как все сразу, так и по одному);\n4) удалять записи." +
                "\nНо это все возможно при одном единственном условии... Если мой автор не дурачок, то все должно работать нормально." +
                "\nКоманды для работы со мной:\n0 - оборвать мой жизненный цикл\n1 - создать запись\n2 - редактировать запись по ID" +
                "\n3 - показать все ваши записи\n4 - посмотреть запись по ID\n5 - удалить запись по ID.");
                Console.WriteLine("***********************************************************************************************************************");
                bool isNum = Int32.TryParse(Console.ReadLine(), out int a);
                if (isNum == false)
                {
                    Console.Clear();
                    continue;
                }
                if (a == 0)
                {
                    break;
                }
                Console.Clear();
                switch (a)
                {
                    case 1:
                        Console.WriteLine("Заполнение записной книжки");
                        Note.CreateNote();
                        break;
                    case 2:
                        Console.WriteLine("Редактирование записной книжки");
                        Console.WriteLine("***********************************************************************************************************************");
                        Note.NoteEditor();
                        break;
                    case 3:
                        Console.WriteLine("Просмотр всех записей");
                        Console.WriteLine("***********************************************************************************************************************");
                        Note.NoteDisplay();
                        break;
                    case 4:
                        Console.WriteLine("Просмотр записи по ID");
                        Console.WriteLine("***********************************************************************************************************************");
                        Note.ViewWithId();
                        break;
                    case 5:
                        Console.WriteLine("Удаление записи по ID");
                        Console.WriteLine("***********************************************************************************************************************");
                        Note.DeleteNote();
                        break;
                    default:
                        Console.WriteLine("К сожалению, я ограничен в своих возможностях, т.к. у моего автора не хватило кое-каких ресурсов реализовать бОльшую функциональность и я не совсем понимаю что делать дальше.\nВведите пожалуйста команду, которую я смогу выполнить (цифру от 0 до 5):");
                        Console.WriteLine("***********************************************************************************************************************");
                        break;
                }
            }
        }
    }
}